alexandrephl/tm4c-QP-C-BlinkyButton/Application/bsp.c
/******************************************************************************
* @file    bsp.c
* @brief   Board Support Package for EK-TM4C123GXL
* @board   EK-TM4C123GXL (TM4C123GH6PM)
* @author  Alexandre Panhaleux
******************************************************************************/
#include "qpc.h"            /* QPC API */
#include "bsp.h"            /* Board Support Package */
#include "TM4C123GH6PM.h"   /* the TM4C MCU Peripheral Access Layer (TI) */

/* GPIOF pin bits ===============================================*/
/* LEDs on the board */
#define LED_RED   (1U << 1)
#define LED_BLUE  (1U << 2)
#define LED_GREEN (1U << 3)

/* on-board switch */
#define BTN_SW1   (1U << 4)

static uint32_t volatile l_tickCtr;

/* Systick handler ISR application hooks ===============================================*/
void SysTick_Handler(void) {

    QXK_ISR_ENTRY(); /* inform QXK about entering an ISR */

    QF_TICK_X(0U, (void *) 0); /* process time events (tick rate 0) */

    ++l_tickCtr;

    QXK_ISR_EXIT(); /* inform QXK about exiting an ISR */
}

void GPIOPortF_IRQHandler(void) {

    QXK_ISR_ENTRY(); /* inform QXK about entering an ISR */

    if ((GPIOF_AHB->RIS & BTN_SW1) != 0U){ /* iterrupt coming from the botton switch */
        QXSemaphore_signal(&SW1_sema);
    }
    GPIOF_AHB->ICR = 0xFFU; /* clear interrupt sources */
    QXK_ISR_EXIT(); /* inform QXK about exiting an ISR */
}

/* BSP init ===========================================================*/
void BSP_init(void) {
    SYSCTL->GPIOHBCTL |= (1U << 5); /* enable AHB for GPIOF */
    SYSCTL->RCGCGPIO  |= (1U << 5); /* enable Run Mode for GPIOF */

    /* LEDs: PF1/PF2/PF3 outputs, digital enable */
    GPIOF_AHB->DIR |= (LED_RED | LED_BLUE | LED_GREEN);
    GPIOF_AHB->DEN |= (LED_RED | LED_BLUE | LED_GREEN);

    /* configure switch SW1 */
    GPIOF_AHB->DIR &= ~(BTN_SW1); /* input */
    GPIOF_AHB->DEN |= (BTN_SW1); /* digital enable */
    GPIOF_AHB->PUR |= (BTN_SW1); /* pull up resistor unable */

    /* GPIO interrupt setup for the SW1 */
    GPIOF_AHB->IS  &= ~(BTN_SW1);    /* edge-triggered */
    GPIOF_AHB->IBE &= ~(BTN_SW1);    /* single-edge */
    GPIOF_AHB->IEV &= ~(BTN_SW1);    /* falling edge */
    GPIOF_AHB->IM  |=  (BTN_SW1);    /* unmask interrupt */
}

/* LED helpers ===========================================================*/
void BSP_ledRedOn(void) {
    GPIOF_AHB->DATA_Bits[LED_RED] = LED_RED;
}

void BSP_ledRedOff(void) {
    GPIOF_AHB->DATA_Bits[LED_RED] = 0U;
}

void BSP_ledBlueOn(void) {
    GPIOF_AHB->DATA_Bits[LED_BLUE] = LED_BLUE;
}

void BSP_ledBlueOff(void) {
    GPIOF_AHB->DATA_Bits[LED_BLUE] = 0U;
}

void BSP_ledGreenOn(void) {
    GPIOF_AHB->DATA_Bits[LED_GREEN] = LED_GREEN;
}

void BSP_ledGreenOff(void) {
    GPIOF_AHB->DATA_Bits[LED_GREEN] = 0U;
}

/* QF start/cleanup hooks ===========================================================*/
void QF_onStartup(void){
    SystemCoreClockUpdate();
    SysTick_Config(SystemCoreClock / BSP_TICKS_PER_SEC);

    /* set the interrupt priorities of 'kernel aware' */
    NVIC_SetPriority(SysTick_IRQn, QF_AWARE_ISR_CMSIS_PRI);
    NVIC_SetPriority(GPIOF_IRQn, QF_AWARE_ISR_CMSIS_PRI + 1);

    /* enable IRQs in NVIC...*/
    NVIC_EnableIRQ(GPIOF_IRQn);
}

void QF_onCleanup(void){
    /* optional: turn off peripherals, etc. */
}

void QXK_onIdle(void){
    /* Optional heartbeat: a quick PF1 toggle to show idle activity */
    GPIOF_AHB->DATA_Bits[LED_RED] = LED_RED;
    GPIOF_AHB->DATA_Bits[LED_RED] = 0U;
    //__WFI(); /* stop the CPU and Wait for interrupt */
}

/* Assertions ===========================================================*/
_Noreturn void Q_onAssert(char const * const module, int const id) {
    (void)module; // unused parameter
    (void)id;     // unused parameter
#ifndef NDEBUG
    // light up all LEDs
    GPIOF_AHB->DATA_Bits[LED_GREEN | LED_RED | LED_BLUE] = 0xFFU;
    // for debugging, hang on in an endless loop...
    for (;;) {
    }
#endif
    NVIC_SystemReset();
}

_Noreturn void assert_failed(char const * const module, int const id);
_Noreturn void assert_failed(char const * const module, int const id) {
    Q_onAssert(module, id);
}
